from fugashi import Tagger
import re

KANJI_REGEX = re.compile(r'[\u4e00-\u9fff]')  # Unicode range for CJK Unified Ideographs

def katakana_to_hiragana(katakana):
    return ''.join(
        chr(ord(ch) - 0x60) if 'ァ' <= ch <= 'ン' else ch
        for ch in katakana
    )

def add_furigana(text, tagger=None):
    if tagger is None:
        tagger = Tagger()
    result = ''
    for word in tagger(text):
        surface = word.surface
        reading = getattr(word.feature, 'reading', None) or surface

        if KANJI_REGEX.search(surface) and surface != reading and reading != '*':
            hiragana = katakana_to_hiragana(reading)
            result += f"<ruby>{surface}<rt>{hiragana}</rt></ruby>"
        else:
            result += surface
    return result

from .models import Test

def update_test_names_to_arabic():
    translations = {
        "レッスン３-文": "الدرس 3 - جمل",
        "レッスン３-語彙": "الدرس 3 - مفردات",
        "レッスン２-会話": "الدرس 2 - محادثة",
        "レッスン２-語彙": "الدرس 2 - مفردات",
        "レッスン１-会話": "الدرس 1 - محادثة",
        "レッスン１-語彙": "الدرس 1 - مفردات",
        "レッスン８-語彙-書く": "الدرس 8 - مفردات - كتابة",
        "レッスン７-語彙-書く": "الدرس 7 - مفردات - كتابة",
        "レッスン６-語彙-書く": "الدرس 6 - مفردات - كتابة",
        "レッスン５-語彙-書く": "الدرس 5 - مفردات - كتابة",
        "レッスン３-語彙-書く": "الدرس 3 - مفردات - كتابة",
        "レッスン７-語彙-書く": "الدرس 7 - مفردات - كتابة",
        "レッスン６-語彙-書く": "الدرس 6 - مفردات - كتابة",
        "レッスン５-語彙-書く": "الدرس 5 - مفردات - كتابة",
        "レッスン４-語彙-書く": "الدرس 4 - مفردات - كتابة",
        "レッスン３-語彙-書く": "الدرس 3 - مفردات - كتابة",
        "レッスン１-語彙-書く": "الدرس 1 - مفردات - كتابة",
        "レッスン４-できる": "الدرس 4 - القدرات",
        "文法的語彙-音無し": "مفردات نحوية - بدون صوت",
        "語彙-会話": "مفردات - محادثة",
        "文法-会話": "نحو - محادثة",
        "語彙１ー７９１音声なし": "مفردات 1-791 بدون صوت",
        "語彙１ー７９１": "مفردات 1-791",
        "語彙７５０ー７９１": "مفردات 750-791",
        "語彙７００ー７５０": "مفردات 700-750",
        "語彙６５０ー７００": "مفردات 650-700",
        "語彙６００ー６５０": "مفردات 600-650",
        "語彙５５０ー６００": "مفردات 550-600",
        "語彙５００ー５５０": "مفردات 500-550",
        "語彙４５０ー５００": "مفردات 450-500",
        "語彙４００ー４５０": "مفردات 400-450",
        "語彙３５０ー４００": "مفردات 350-400",
        "語彙３００ー３５０": "مفردات 300-350",
        "語彙２５０ー３００": "مفردات 250-300",
        "語彙２００ー２５０": "مفردات 200-250",
        "語彙１５０ー２００": "مفردات 150-200",
        "語彙１００ー１５０": "مفردات 100-150",
        "語彙５０ー１００": "مفردات 50-100",
        "語彙１－５０": "مفردات 1-50",
        "レッスン３-ひんど": "الدرس 3 - التكرار",
        "文法-文の返事": "نحو - الردود الجملية",
        "レッスン３-時間割": "الدرس 3 - الجدول الزمني",
        "レッスン３-好きな教科": "الدرس 3 - المادة المفضلة",
        "語彙１ー７７８音声なし": "مفردات 1-778 بدون صوت",
        "語彙１ー７７８": "مفردات 1-778",
        "語彙７５０ー７７８": "مفردات 750-778",
    }

    for jp_name, ar_name in translations.items():
        Test.objects.filter(name=jp_name).update(name_ar=ar_name)